Revit 2027 API
BuiltInFailures.FabricFailures.MajorSpacingFailure Property
 The spacing in the major direction is lower than diameter of the wire in the minor direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MajorSpacingFailure { get; }
Public Shared ReadOnly Property MajorSpacingFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MajorSpacingFailure {
	FailureDefinitionId^ get ();
}
static member MajorSpacingFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace